{
  "homePage": {
    "title": "Hello, I am",
    "stack": "JUNIOR FULL STACK DEVELOPER.",
    "cv": "Resume",
    "aboutMe": {
      "title": "About Me",
      "description": "I am Ruan Vieira, 24 years old, and I work as a Junior Fullstack Developer. I always strive to meet the needs of the projects I work on, delivering efficient and well-structured solutions.\n\nThroughout my career, I have been specializing in system integration, process automation, and workflow optimization, ensuring consistent, scalable, and high-quality results.\n\nMore than just writing code, I seek to deeply understand the goals and challenges of each project, proposing strategic and personalized solutions. I focus on quality, usability, and impact, and maintain a constant commitment to professional growth and the application of best development practices."
    },
    "experience": {
      "title": "Experience",
      "companys": {
        "chamagarcom": {
          "company": "Chama Garçom",
          "location": "São Paulo - Brazil",
          "duration": "03/2025 - Present",
          "description": "I worked directly with the client in gathering requirements, understanding objectives and expectations, and guiding each stage of the development of the Chama Garçom platform, composed of a website, web dashboard, and mobile app (Android and iOS).\n\nThe system integrates table management via QR Code, waiter control, real-time requests, a manageable digital menu, push notifications, and operational reports, providing a modern and efficient experience for restaurants and their customers.\n\nI contributed from technical planning and architecture definition to implementing the main functionalities, ensuring quality, performance, and integration across web and mobile platforms."
        },
        "sicencevet": {
          "company": "ScienceVet",
          "location": "São Paulo - Brazil",
          "duration": "03/2025 - 07/2025",
          "description": "Development of an integrated platform for managing veterinary studies, including animal management, supplies, farms, sponsors, and quality control, along with automated generation of scientific reports.\n\nThe system brought greater rigor and traceability to processes, recording each study step with date and responsible party, enabling complete activity control and accurate reporting for submission to the Ministry of Agriculture and other regulatory bodies.\n\nI worked from understanding business rules to implementing core functionalities, focusing on automation, data reliability, and regulatory compliance."
        },
        "simplify": {
          "company": "Simplify Code",
          "location": "São Paulo - Brazil",
          "duration": "09/2021 - Present",
          "description": "I work as a Fullstack developer, collaborating directly with clients to understand their goals, expectations, and challenges for each project. I am responsible for planning, guiding, and overseeing all development stages, ensuring delivered solutions meet the specific needs of each client efficiently and scalably.\n\nCurrently, I work as a freelancer on a wide range of projects, allowing me to explore new challenges and provide custom solutions, always prioritizing clear communication and continuous alignment with client objectives.\n\nThis approach has enabled me to develop both technical and interpersonal skills, ensuring that each project is completed with quality, on time, and aligned with client goals."
        }
      }
    },
    "education": {
      "title": "Education",
      "institutions": {
        "fiap": {
          "institution": "FIAP",
          "degree": "Systems Analysis and Development",
          "location": "São Paulo - Brazil",
          "duration": "01/2020 - 12/2021"
        }
      }
    },
    "expertise": {
      "title": "Skills",
      "skills": {
        "Básico": "Basic",
        "Intermediário": "Intermediate",
        "Avançado": "Advanced"
      }
    },
    "projects": {
      "title": "Projects",
      "items": {
        "techmoney": {
          "name": "TechMoney",
          "description": "Personal project: a complete platform for personal financial management, offering control over transactions, bank accounts, investments, financial goals, and recurring transactions, with an analytical dashboard and detailed reports for strategic financial insight.\n\nThe project includes automatic expense and income categorization, credit card integration, and a responsive modern interface, providing an intuitive experience and efficient financial management.\n\nI worked on all development stages, from architecture planning to feature implementation, delivering a scalable, practical, and fully customized solution."
        },
        "chamagarcom": {
          "name": "Chama Garçom",
          "description": "I worked directly with the client in gathering requirements, understanding objectives and expectations, and guiding each stage of the development of the Chama Garçom platform, composed of a website, web dashboard, and mobile app (Android and iOS).\n\nThe system integrates table management via QR Code, waiter control, real-time requests, a manageable digital menu, push notifications, and operational reports, providing a modern and efficient experience for restaurants and their customers.\n\nI contributed from technical planning and architecture definition to implementing the main functionalities, ensuring quality, performance, and integration across web and mobile platforms."
        },
        "portifolio": {
          "name": "Portfolio",
          "description": "I developed a responsive personal portfolio using Next.js, TypeScript, and TailwindCSS. The goal of this project was to create a platform that clearly and effectively presented my skills, experiences, and completed projects. With an intuitive interface and clean design, the portfolio highlights my web development competencies, offering an attractive and efficient experience for visitors."
        },
        "tlgmedia": {
          "name": "TLG MEDIA",
          "description": "For a visual production company, I created a landing page focused on showcasing their works and services. Using HTML, CSS, JavaScript, and Express, the project included an interactive gallery of images and videos, allowing visitors to explore the company's portfolio dynamically and engagingly. The page was optimized for responsiveness, ensuring a great experience on both desktop and mobile devices."
        },
        "simplify": {
          "name": "Simplify Code",
          "description": "I developed a landing page for a technology company aimed at promoting its services and innovative solutions. The design focused on conversion, using Next.js and TailwindCSS to create a modern and efficient interface. Additionally, I implemented integrations with contact forms and calls-to-action to facilitate client communication and increase lead conversion."
        },
        "shopper": {
          "name": "Shopper Technical Test",
          "description": "I completed a technical test for the Shopper platform simulating a taxi management system using the Google Maps API. The project involved creating functionalities to locate, track, and manage taxis in real time. Using Next.js, TypeScript, PostgreSQL, and Prisma, the system was designed to be efficient and scalable, ensuring a great user experience and robust performance."
        }
      }
    }
  }
}
