{
  "homePage": {
    "title": "Hello, I am",
    "stack": "JUNIOR FULL STACK DEVELOPER.",
    "cv": "Resume",
    "aboutMe": {
      "title": "About me",
      "description": "I am a Fullstack developer with solid experience in Node.js, TypeScript, JavaScript, and MongoDB. As a freelancer, I have specialized in creating complete solutions for a wide variety of projects, always focusing on efficient and scalable systems.\n\nI have experience in both backend, with technologies such as Node.js and MongoDB, and frontend, using React, Next.js, and Tailwind. Additionally, I use tools like Docker and ElectronJS to ensure the performance and scalability of the solutions I develop. Throughout my career, I have specialized in integrating systems and automating processes, always aiming to meet the real needs of my clients effectively.\n\nMore than just developing, I aim to understand the project's needs strategically, ensuring that the delivered solutions are the most suitable, efficient, and scalable. I am always seeking professional growth, adopting the best practices and technologies to ensure the quality of the projects I work on."
    },
    "experience": {
      "title": "Experience",
      "companys": {
        "simplify": {
          "company": "Simplify Code",
          "location": "São Paulo - Brazil",
          "duration": "09/2021 - Present",
          "description": "I worked as a Fullstack developer, collaborating on projects with technologies like React, Node.js, Docker, and PostgreSQL. My responsibilities included creating robust APIs, integrating with third-party services, and developing user-friendly interfaces.\n\nCurrently, I continue to work as a freelance Fullstack developer, handling a wide range of projects that allow me to explore new challenges and technologies. I have the opportunity to collaborate with clients from different sectors, specializing in creating tailor-made solutions that meet each client's specific needs, always focusing on choosing the most appropriate tools for each project.\n\nMy responsibilities include developing robust integrations, such as automations on Discord, as well as building complete interfaces and backend systems using technologies such as Node.js, TypeScript, ElectronJS, Docker, PostgreSQL, MongoDB, Prisma, React, Next.js, and Tailwind. Throughout this journey, I strive to deeply understand my clients' objectives and challenges to deliver solutions that align with their goals effectively.\n\nThis experience has been enriching, allowing me to evolve both technically and in communication, which is essential to ensure that clients' expectations are always aligned with the results delivered."
        }
      }
    },
    "education": {
      "title": "Education",
      "institutions": {
        "fiap": {
          "institution": "FIAP",
          "degree": "Systems Analysis and Development",
          "location": "São Paulo - Brazil",
          "duration": "01/2020 - 12/2021"
        }
      }
    },
    "expertise": {
      "title": "Skills",
      "skills": {
        "Básico": "Basic",
        "Intermediário": "Intermediate",
        "Avançado": "Advanced"
      }
    },
    "projects": {
      "title": "Projects",
      "items": {
        "portifolio": {
          "name": "Portfolio",
          "description": "I developed a responsive personal portfolio using Next.js, TypeScript, and TailwindCSS. The goal of this project was to create a platform that clearly and organizedly presented my skills, experiences, and completed projects. With an intuitive interface and a clean design, the portfolio highlights my web development skills, providing an attractive and efficient visual experience for visitors."
        },
        "tlgmedia": {
          "name": "TLG MEDIA",
          "description": "For a visual producer, I created a landing page focused on showcasing the works and services offered. Using HTML, CSS, JavaScript, and Express, the project included an interactive gallery of images and videos, allowing visitors to explore the producer's portfolio in a dynamic and engaging way. The page was optimized to be responsive, ensuring a great experience on both desktops and mobile devices."
        },
        "simplify": {
          "name": "Simplify Code",
          "description": "I developed a landing page for a technology company with the aim of promoting its services and innovative solutions. The design was focused on conversion, using Next.js and TailwindCSS to create a modern and efficient interface. Additionally, I implemented integrations with contact forms and calls-to-action, aiming to facilitate communication with clients and increase lead conversion."
        },
        "shopper": {
          "name": "Shopper Technical Test",
          "description": "I conducted a technical test for the Shopper platform that simulates a taxi management system using the Google Maps API. The project involved creating features to locate, track, and manage taxis in real-time. Using Next.js, TypeScript, PostgreSQL, and Prisma, the system was designed to be efficient and scalable, ensuring an excellent user experience and robust performance."
        }
      }
    }
  }
}
