{
  "homePage": {
    "title": "Hola, soy",
    "stack": "DESARROLLADOR FULL STACK JUNIOR.",
    "cv": "Currículum",
    "aboutMe": {
      "title": "Sobre mí",
      "description": "Soy Ruan Vieira, tengo 24 años y trabajo como Desarrollador Fullstack Junior. Siempre busco satisfacer las necesidades de los proyectos en los que trabajo, ofreciendo soluciones eficientes y bien estructuradas.\n\nA lo largo de mi trayectoria, me he especializado en integración de sistemas, automatización de procesos y optimización de flujos de trabajo, garantizando resultados consistentes, escalables y de alta calidad.\n\nMás que solo escribir código, busco comprender a fondo los objetivos y desafíos de cada proyecto, proponiendo soluciones estratégicas y personalizadas. Me enfoco en la calidad, la usabilidad y el impacto, manteniendo un compromiso constante con el crecimiento profesional y la aplicación de las mejores prácticas de desarrollo."
    },

    "experience": {
      "title": "Experiencia",
      "companys": {
        "chamagarcom": {
          "company": "Chama Garçom",
          "location": "São Paulo - Brasil",
          "duration": "03/2025 - Actual",
          "description": "Trabajé directamente con el cliente en la recopilación de requisitos, comprensión de objetivos y expectativas, y en la orientación en cada etapa del desarrollo de la plataforma Chama Garçom, compuesta por sitio web, panel web y aplicación móvil (Android e iOS).\n\nEl sistema integra gestión de mesas vía QR Code, control de meseros, solicitudes en tiempo real, menú digital administrable, notificaciones push e informes operativos, ofreciendo una experiencia moderna y eficiente para restaurantes y sus clientes.\n\nContribuí desde la planificación técnica y definición de la arquitectura hasta la implementación de las principales funcionalidades, garantizando calidad, rendimiento e integración entre las plataformas web y móvil."
        },
        "sicencevet": {
          "company": "ScienceVet",
          "location": "São Paulo - Brasil",
          "duration": "03/2025 - 07/2025",
          "description": "Desarrollo de una plataforma integrada para la gestión de estudios veterinarios, incluyendo control de animales, suministros, granjas, patrocinadores y control de calidad, además de generación automatizada de informes científicos.\n\nEl sistema aportó mayor rigor y trazabilidad a los procesos, registrando cada etapa de los estudios con fecha y responsable, lo que permitió un control completo de las actividades y la emisión de informes precisos para presentación al Ministerio de Agricultura y otros organismos regulatorios.\n\nParticipé desde la comprensión de las reglas de negocio hasta la implementación de las funcionalidades principales, con enfoque en automatización, confiabilidad de datos y cumplimiento normativo."
        },
        "simplify": {
          "company": "Simplify Code",
          "location": "São Paulo - Brasil",
          "duration": "09/2021 - Actual",
          "description": "Trabajo como desarrollador Fullstack, colaborando directamente con los clientes para entender sus objetivos, expectativas y desafíos en cada proyecto. Soy responsable de planificar, guiar y supervisar todas las etapas de desarrollo, asegurando que las soluciones entregadas satisfagan las necesidades específicas de cada cliente de manera eficiente y escalable.\n\nActualmente, trabajo como freelancer en una amplia gama de proyectos, lo que me permite explorar nuevos desafíos y proporcionar soluciones a medida, siempre priorizando la comunicación clara y la alineación continua con los objetivos del cliente.\n\nEste enfoque me ha permitido desarrollar habilidades técnicas e interpersonales, asegurando que cada proyecto se complete con calidad, dentro del plazo y alineado con las metas de los clientes."
        }
      }
    },
    "education": {
      "title": "Educación",
      "institutions": {
        "fiap": {
          "institution": "FIAP",
          "degree": "Análisis y Desarrollo de Sistemas",
          "location": "São Paulo - Brasil",
          "duration": "01/2020 - 12/2021"
        }
      }
    },
    "expertise": {
      "title": "Habilidades",
      "skills": {
        "Básico": "Básico",
        "Intermediário": "Intermedio",
        "Avançado": "Avanzado"
      }
    },
    "projects": {
      "title": "Proyectos",
      "items": {
        "techmoney": {
          "name": "TechMoney",
          "description": "Proyecto propio: plataforma completa para gestión financiera personal, ofreciendo control de transacciones, cuentas bancarias, inversiones, metas financieras y transacciones recurrentes, con panel analítico e informes detallados para una visión estratégica de las finanzas.\n\nEl proyecto incluye categorización automática de gastos e ingresos, integración con tarjeta de crédito e interfaz moderna y responsiva, proporcionando una experiencia intuitiva y una gestión financiera eficiente.\n\nParticipé en todas las etapas del desarrollo, desde la planificación de la arquitectura hasta la implementación de las funcionalidades, garantizando una solución escalable, práctica y completamente personalizada."
        },
        "chamagarcom": {
          "name": "Chama Garçom",
          "description": "Trabajé directamente con el cliente en la recopilación de requisitos, comprensión de objetivos y expectativas, y en la orientación en cada etapa del desarrollo de la plataforma Chama Garçom, compuesta por sitio web, panel web y aplicación móvil (Android e iOS).\n\nEl sistema integra gestión de mesas vía QR Code, control de meseros, solicitudes en tiempo real, menú digital administrable, notificaciones push e informes operativos, ofreciendo una experiencia moderna y eficiente para restaurantes y sus clientes.\n\nContribuí desde la planificación técnica y definición de la arquitectura hasta la implementación de las principales funcionalidades, garantizando calidad, rendimiento e integración entre las plataformas web y móvil."
        },
        "portifolio": {
          "name": "Portafolio",
          "description": "Desarrollé un portafolio personal responsivo utilizando Next.js, TypeScript y TailwindCSS. El objetivo de este proyecto fue crear una plataforma que presentara de manera clara y organizada mis habilidades, experiencias y proyectos realizados. Con una interfaz intuitiva y un diseño limpio, el portafolio destaca mis competencias en desarrollo web, ofreciendo una experiencia visual atractiva y eficiente para los visitantes."
        },
        "tlgmedia": {
          "name": "TLG MEDIA",
          "description": "Para una productora visual, creé una landing page enfocada en mostrar sus trabajos y servicios. Utilizando HTML, CSS, JavaScript y Express, el proyecto incluyó una galería interactiva de imágenes y videos, permitiendo que los visitantes exploraran el portafolio de manera dinámica y atractiva. La página fue optimizada para ser responsiva, asegurando una excelente experiencia en desktop y dispositivos móviles."
        },
        "simplify": {
          "name": "Simplify Code",
          "description": "Desarrollé una landing page para una empresa de tecnología con el objetivo de promover sus servicios y soluciones innovadoras. El diseño se enfocó en conversión, utilizando Next.js y TailwindCSS para crear una interfaz moderna y eficiente. Además, implementé integraciones con formularios de contacto y llamadas a la acción, facilitando la comunicación con clientes y aumentando la conversión de leads."
        },
        "shopper": {
          "name": "Shopper Prueba Técnica",
          "description": "Realicé una prueba técnica para la plataforma Shopper simulando un sistema de gestión de taxis utilizando la API de Google Maps. El proyecto incluyó la creación de funcionalidades para localizar, rastrear y gestionar taxis en tiempo real. Utilizando Next.js, TypeScript, PostgreSQL y Prisma, el sistema fue diseñado para ser eficiente y escalable, garantizando una excelente experiencia de usuario y un rendimiento sólido."
        }
      }
    }
  }
}
