{
  "homePage": {
    "title": "Olá, eu sou",
    "stack": "DESENVOLVEDOR FULL STACK JÚNIOR.",
    "cv": "Currículo",
    "aboutMe": {
      "title": "Sobre mim",
      "description": "Sou Ruan Vieira, tenho 24 anos e atuo como Desenvolvedor Fullstack Júnior. Busco sempre atender às necessidades dos projetos em que trabalho, entregando soluções eficientes e bem estruturadas.\n\nAo longo da minha trajetória, venho me especializando em integração de sistemas, automação de processos e otimização de fluxos de trabalho, garantindo resultados consistentes, escaláveis e de alta qualidade.\n\nMais do que apenas escrever código, procuro entender a fundo os objetivos e desafios de cada projeto, propondo soluções estratégicas e personalizadas. Tenho foco em qualidade, usabilidade e impacto, e mantenho um compromisso constante com a evolução profissional e a aplicação das melhores práticas de desenvolvimento."
    },
    "experience": {
      "title": "Experiência",
      "companys": {
        "chamagarcom": {
          "company": "Chama Garçom",
          "location": "São Paulo - Brasil",
          "duration": "03/2025 - Atual",
          "description": "Atuei diretamente com o cliente no levantamento de requisitos, entendimento dos objetivos e expectativas e na orientação em cada etapa do desenvolvimento da plataforma Chama Garçom, composta por site, dashboard web e aplicativo móvel (Android e iOS).\n\nO sistema integra gestão de mesas via QR Code, controle de garçons, chamados em tempo real, cardápio digital gerenciável, notificações push e relatórios operacionais, oferecendo uma experiência moderna e eficiente para restaurantes e seus clientes.\n\nContribuí desde o planejamento técnico e definição da arquitetura até a implementação das principais funcionalidades, garantindo qualidade, desempenho e integração entre as plataformas web e mobile."
        },
        "sicencevet": {
          "company": "ScienceVet",
          "location": "São Paulo - Brasil",
          "duration": "03/2025 - 07/2025",
          "description": "Desenvolvimento de uma plataforma integrada para gestão de estudos veterinários, contemplando controle de animais, insumos, fazendas, patrocinadores e qualidade, além de geração automatizada de relatórios científicos.\n\nO sistema trouxe maior rigidez e rastreabilidade aos processos, registrando cada etapa dos estudos com data e responsável, o que possibilitou um controle completo das atividades e emissão de relatórios precisos para apresentação ao Ministério da Fazenda e demais órgãos regulatórios.\n\nAtuei desde o entendimento das regras de negócio até a implementação das principais funcionalidades, com foco em automação, confiabilidade dos dados e conformidade regulatória."
        },
        "simplify": {
          "company": "Simplify Code",
          "location": "São Paulo - Brasil",
          "duration": "09/2021 - Atual",
          "description": "Atuo como desenvolvedor Fullstack, colaborando diretamente com clientes para compreender seus objetivos, expectativas e desafios em cada projeto. Sou responsável por planejar, orientar e acompanhar todas as etapas do desenvolvimento, garantindo que as soluções entregues atendam às necessidades específicas de cada cliente de forma eficiente e escalável.\n\nAtualmente, trabalho como freelancer em uma ampla variedade de projetos, o que me permite explorar novos desafios e oferecer soluções sob medida, sempre priorizando uma comunicação clara e o alinhamento constante com os objetivos do cliente.\n\nEssa abordagem tem me permitido aprimorar minhas habilidades técnicas e interpessoais, assegurando que cada projeto seja concluído com qualidade, dentro do prazo e em total conformidade com as metas dos clientes."
        }
      }
    },
    "education": {
      "title": "Educação",
      "institutions": {
        "fiap": {
          "institution": "FIAP",
          "degree": "Análise e Desenvolvimento de Sistemas",
          "location": "São Paulo - Brasil",
          "duration": "01/2020 - 12/2021"
        }
      }
    },
    "expertise": {
      "title": "Habilidades",
      "skills": {
        "Básico": "Básico",
        "Intermediário": "Intermediário",
        "Avançado": "Avançado"
      }
    },
    "projects": {
      "title": "Projetos",
      "items": {
        "techmoney": {
          "name": "TechMoney",
          "description": "Projeto próprio de plataforma completa para gestão financeira pessoal, oferecendo controle de transações, contas bancárias, investimentos, metas financeiras e transações recorrentes, com dashboard analítico e relatórios detalhados para uma visão estratégica das finanças.\n\nO projeto inclui categorização automática de despesas e receitas, integração com cartão de crédito, interface responsiva e moderna, proporcionando experiência intuitiva e gestão financeira eficiente.\n\nAtuei em todas as etapas do desenvolvimento, desde o planejamento da arquitetura até a implementação das funcionalidades, garantindo uma solução escalável, prática e totalmente sob medida."
        },
        "chamagarcom": {
          "name": "Chama Garçom",
          "description": "Atuei diretamente com o cliente no levantamento de requisitos, entendimento dos objetivos e expectativas e na orientação em cada etapa do desenvolvimento da plataforma Chama Garçom, composta por site, dashboard web e aplicativo móvel (Android e iOS).\n\nO sistema integra gestão de mesas via QR Code, controle de garçons, chamados em tempo real, cardápio digital gerenciável, notificações push e relatórios operacionais, oferecendo uma experiência moderna e eficiente para restaurantes e seus clientes.\n\nContribuí desde o planejamento técnico e definição da arquitetura até a implementação das principais funcionalidades, garantindo qualidade, desempenho e integração entre as plataformas web e mobile."
        },
        "portifolio": {
          "name": "Portfólio",
          "description": "Desenvolvi um portfólio pessoal responsivo utilizando Next.js, TypeScript e TailwindCSS. O objetivo deste projeto foi criar uma plataforma que apresentasse de maneira clara e organizada minhas habilidades, experiências e projetos realizados. Com uma interface intuitiva e um design clean, o portfólio destaca minhas competências em desenvolvimento web, oferecendo uma experiência visual atrativa e eficiente para os visitantes."
        },
        "tlgmedia": {
          "name": "TLG MEDIA",
          "description": "Para uma produtora visual, criei uma landing page com foco na exibição de trabalhos e serviços oferecidos. Utilizando HTML, CSS, JavaScript e Express, o projeto incluiu uma galeria interativa de imagens e vídeos, permitindo que os visitantes explorassem o portfólio da produtora de maneira dinâmica e envolvente. A página foi otimizada para ser responsiva, garantindo uma ótima experiência tanto em desktops quanto em dispositivos móveis."
        },
        "simplify": {
          "name": "Simplify Code",
          "description": "Desenvolvi uma landing page para uma empresa de tecnologia com o objetivo de promover seus serviços e soluções inovadoras. O design foi focado em conversão, utilizando Next.js e TailwindCSS para criar uma interface moderna e eficiente. Além disso, implementei integrações com formulários de contato e calls-to-action, visando facilitar a comunicação com os clientes e aumentar a conversão de leads."
        },
        "shopper": {
          "name": "Shopper Teste Técnico",
          "description": "Realizei um teste técnico para a plataforma Shopper que simula um sistema de gerenciamento de táxis utilizando a Google Maps API. O projeto envolveu a criação de funcionalidades para localizar, rastrear e gerenciar táxis em tempo real. Utilizando Next.js, TypeScript, PostgreSQL e Prisma, o sistema foi projetado para ser eficiente e escalável, garantindo uma ótima experiência para o usuário e performance robusta."
        }
      }
    }
  }
}
